In [2]:
import pandas as pd
import numpy as np

In [12]:
dct1 = {
   'Name' : np.random.choice(['Anna', 'Thor', 'Mery'], size = 10),
   'Date_work' : pd.date_range(start= '2019-10-01', periods= 10, freq= 'B'),
   'Salary' : np.random.choice([100, 125, 250], size = 10)
}
df1 = pd.DataFrame(dct1)
df1

   Name  Date_work  Salary
0  Mery 2019-10-01     250
1  Anna 2019-10-02     250
2  Thor 2019-10-03     125
3  Mery 2019-10-04     250
4  Thor 2019-10-07     100
5  Mery 2019-10-08     250
6  Mery 2019-10-09     250
7  Thor 2019-10-10     250
8  Mery 2019-10-11     250
9  Mery 2019-10-14     100

In [13]:
dct2 = {
   'Name' : np.random.choice(['Anna', 'Thor', 'Mery'], size = 10),
   'Date_work' : pd.date_range(start= '2019-10-01', periods= 10, freq= 'B'),
   'Salary' : np.random.choice([100, 125, 250], size = 10)
}
df2 = pd.DataFrame(dct2)
df2

   Name  Date_work  Salary
0  Thor 2019-10-01     250
1  Anna 2019-10-02     125
2  Anna 2019-10-03     250
3  Thor 2019-10-04     125
4  Anna 2019-10-07     125
5  Anna 2019-10-08     125
6  Thor 2019-10-09     250
7  Thor 2019-10-10     125
8  Anna 2019-10-11     250
9  Mery 2019-10-14     250

In [33]:
pd.concat([df1, df2]).reset_index().reindex(columns = ['Salary'], index = [3,4,20]).sort_index(ascending = False)

    Salary
20     NaN
4    100.0
3    250.0